/*-----------------------------------------------
  名称：步进电机
  论坛：www.doflye.net
  编写：shifang
  日期：2009.5
  修改：无
  内容：本程序用于测试4相步进电机常规驱动 使用1相励磁

 ------------------------------------------------*/


#include<dianji.h>



unsigned char Speed;

/*------------------------------------------------
                    主函数
------------------------------------------------*/
void dianji()
{
	int i=0;
 //unsigned int i=64*16; //转2周停止
 Speed=5; //调整速度
 for(i;i<1000;i++) 
  {         
     Coil_A1                 //遇到Coil_A1  用{A1=1;B1=0;C1=0;D1=0;}代替
     DelayMs(Speed);         //改变这个参数可以调整电机转速 ,
	                         //数字越小，转速越大,力矩越小
     Coil_B1
     DelayMs(Speed);
     Coil_C1
     DelayMs(Speed);
     Coil_D1
     DelayMs(Speed);
  }
}